<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.0.0/dist/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
    <title>พิมพ์ใบสมัคร</title>
</head>
<style>
    * {
        margin: 0;
        padding: 0;
    }

    .btn {
        padding: 1rem;
        width: 100px;
        margin: 1rem 6rem;
        float: right;
    }

    .card-container {

        margin: 2.5rem;
        box-shadow: rgba(0, 0, 0, 0.02) 0px 1px 3px 0px, rgba(27, 31, 35, 0.15) 0px 0px 0px 1px;
        height: 100%;
    }

    .body-title {
        display: flex;
        flex-direction: column;
        align-items: center;
        padding: 2rem;
        text-align: center;
    }

    .body-main {
        margin: 2rem;
    }

    p {
        font-size: 23px;
    }

    @media print {
        .print-button {
            display: none;
        }
    }
</style>

<body>

    <div class="card-container">
        <div class="body-title">
            <h3>ใบสมัครงาน</h3>
            <p>โรงน้ำดื่มตราสิรัชญา</p>
            <p>บ.หินดาษ ต.หินดาษ อ.ห้วยแถลง จ.นครราชสีมา 30240</p>
        </div>
        <div class="body-main">
            <p>ตำแหน่งงาน....................................................................</p>
            <p>เงินเดือนที่ต้องการ.........................................................</p>
            <p>ชื่อ..................................................................นามสกุล..................................................................</p>
            <p>วัน เดือน ปีเกิด........................................................อายุ.....................ชื่อเล่น.............................</p>
            <p>เชื้อชาติ...................................สัญชาติ......................................ศาสนา......................................</p>
            <p>บัตรประชาชน...................................ออกให้ ณ......................................วันหมดอายุ......................................</p>
            <p>ที่อยู่ปัจจุบัน.........................................................................มีพี่น้อง....................................คน</p>
            <p>ชื่อบิดา.........................................................................ชื่อมารดา.........................................................................</p>
            <p>เบอร์โทรผู้สมัคร.........................................................................</p>
            <p>เบอร์โทรผู้ที่สามารถติดต่อได้.........................................................................</p>
            <p>สถานภาพทางทหาร</p>
            <input type="checkbox"> ได้รับการยกเว้นเนื่องจาก ........................................................
            <input type="checkbox"> ปลดเป็นทหารกองหนุน พ.ศ. ........................................................
            <br>
            <input type="checkbox"> จะเกณฑ์ทหาร พ.ศ. ........................................................
            <p style="padding: 12px 0 0 0;">การใช้พาหนะ</p>
            <input type="checkbox"> รถยนต์ เลขบัตร....................................................................หมดอายุ........................................... <br>
            <input type="checkbox"> รถจักรยานยนต์ เลขบัตร....................................................................หมดอายุ...........................................
            <p style="padding: 12px 0 0 0;">ประสบการณ์ทำงาน..................................................................................................................</p>
            <p style="text-align: center;">ข้าพเจ้าขอยอมรับว่าข้อมูลทั้งหมดเป็นความจริงทุกประการ</p>
            <p style="text-align: center;">ลงชื่อ ...............................................</p>
            <p style="text-align: center;">(...............................................)</p>
        </div>
    </div>
    <button class="btn btn-info print-button" onclick="window.print()">พิมพ์</button>
</body>

</html>